{
  "version": "0.0.016",
  "name": "Module Architecture Integrity - Inventory → Purchases → Sales Integration",
  "lastUpdated": "2025-12-13",
  "changes": "**MODULE SEQUENCE ENFORCEMENT** - Implemented comprehensive module architecture integrity ensuring Inventory → Purchases → Sales workflow: (1) Inventory Module: Defines all products with current_stock tracking, categories, warehouses, batches, and price history; (2) Purchases Module: Purchase Orders do NOT affect stock until GRN confirmation; Goods Received Notes (GRN) increase inventory when confirmed; Supplier Invoices record supplier costs; Suppliers manage vendor data; (3) Sales Module: Sales Orders can ONLY proceed if current_stock >= quantity_requested; Real-time stock decrement on sale confirmation; Customers manage buyer data; Sales Invoices track transactions. **STOCK MANAGEMENT SYSTEM** - Created /lib/stock-manager.js utility enforcing: getCurrentStock(productId) - validates product existence and current stock level; validateSaleQuantity(productId, requestedQuantity) - blocks sales if insufficient inventory; recordStockMovement(data) - automatically logs all stock transactions with type (purchase_grn, sales_order, inventory_adjustment, return, transfer), reference IDs, warehouse tracking, and timestamps; updateProductStock(productId, quantity, direction) - atomically updates current_stock for 'in' (GRN) or 'out' (Sales) transactions with validation; getPriceHistory(productId) - tracks all price changes for sales validation. **STOCK MOVEMENT TRACKING** - Created /api/inventory/stock-movements/list endpoint providing complete stock transaction history with product name, warehouse, movement type, reference tracking, and filtering by product_id or movement_type. **SALES VALIDATION API** - Created /api/sales/orders POST endpoint enforcing: (a) Stock validation for every line item before creating order; (b) Automatic stock decrement on order creation; (c) Automatic stock movement recording; (d) Tax calculation per item based on product.tax_rate; (e) Real-time total calculation; (f) Transaction rollback on validation failure; (g) Permission checking via hasPermission(). **GRN CONFIRMATION API** - Created /api/purchases/grn-confirm POST endpoint enforcing: (a) GRN status validation (must be draft/partial); (b) Automatic stock increment from GRN line items; (c) Stock movement recording for each received item; (d) Transaction support with rollback; (e) Permission checking. **SIDEBAR LINK FIXES** - Updated DashboardLayout.jsx module hierarchy: Sales (Sales List, POS, Customers=/sales/customers/list, Invoices) → Purchases (Orders, Invoices, GRN, Suppliers=/purchases/suppliers/list) → Inventory (Products, Categories, Movements, Warehouses, Price History, Batches). Fixed broken links: /customers→/sales/customers/list, /suppliers→/purchases/suppliers/list, /products/price-history→/inventory/price-history. **DATABASE SCHEMA ALIGNMENT** - All CRUD operations validated against actual PostgreSQL schema: products (current_stock not quantity, no sku field), product_batches (no deleted_at), supplier_invoices (no deleted_at), sales_orders (status, amount_paid, balance_due), stock_movements (product_id, quantity, movement_type, reference_id), goods_received_notes (grn_number, po_id, status). **BUILD INTEGRITY** - All 31 API route files compile without errors; No breaking changes to existing routes; Full TypeScript elimination (JavaScript-only); Next.js 16 dynamic route params properly awaited. **PERMISSION ENFORCEMENT** - Stock management, GRN confirmation, and sales creation all require requireAuth() and hasPermission() checks with proper 403 Forbidden responses. **TRANSACTION SUPPORT** - Both sales order creation and GRN confirmation use PostgreSQL transactions (BEGIN/COMMIT/ROLLBACK) to ensure consistency: either entire operation succeeds or entire operation rolls back, preventing partial inventory updates. **REAL-TIME BEHAVIOR** - Sales orders immediately decrement stock; GRN confirmation immediately increments stock; All changes logged to stock_movements table with reference tracking. **VALIDATION RULES ENFORCED** - ✓ Sales cannot proceed if stock < quantity; ✓ Purchase Orders don't affect stock (read-only until GRN); ✓ GRN confirmation atomically increases stock; ✓ Stock movements auto-recorded for all transactions; ✓ Price history checked for sales. **VERSIONING** - Updated package.json → 0.0.016, version.json → 0.0.016 with timestamp 2025-12-13."
}
